tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Programatically correct mistyped console commands
brew "thefuck"
# Vi 'workalike' with many additional features
brew "vim"

cask "docker"
cask "dropbox"
cask "font-hack-nerd-font-mono"
cask "franz"
cask "google-chrome"
cask "hammerspoon"
cask "intel-power-gadget"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "lastpass"
cask "mactex-no-gui"
cask "setapp"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
